{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"feature:0": {"name": "feature:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "numfeature:0": {"name": "numfeature:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "1"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_2/normalization_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_2/normalization_2/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "feature", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "numfeature", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/model_2/normalization_1/sub", "op": "Sub", "input": ["feature", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/normalization_2/sub", "op": "Sub", "input": ["numfeature", "unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/normalization_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/normalization_1/sub", "ConstantFolding/StatefulPartitionedCall/model_2/normalization_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/normalization_2/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/normalization_2/sub", "ConstantFolding/StatefulPartitionedCall/model_2/normalization_2/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/normalization_1/truediv", "StatefulPartitionedCall/model_2/normalization_2/truediv", "StatefulPartitionedCall/model_2/concatenate/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate/concat"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/Shape", "StatefulPartitionedCall/model_2/dense/Tensordot/axes", "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/Shape", "StatefulPartitionedCall/model_2/dense/Tensordot/free", "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_2/dense/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model_2/dense/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model_2/dense/Tensordot/Const_2", "StatefulPartitionedCall/model_2/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/Prod", "StatefulPartitionedCall/model_2/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_2/concatenate/concat", "StatefulPartitionedCall/model_2/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/Reshape", "StatefulPartitionedCall/model_2/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot/MatMul", "StatefulPartitionedCall/model_2/dense/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_2/dense/Tensordot"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/ReadVariableOp", "shape": [2, 1], "dtype": "float32"}, {"name": "unknown", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_2/normalization_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_1", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_2/normalization_2/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}]}]}