{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"feature": {"name": "feature:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"target_encoding_1": {"name": "Identity:0", "dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_DOUBLE"}, "value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {}}}}}, {"name": "feature", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/model_4/target_encoding_1/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "feature", "unknown_0"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_DOUBLE"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_4/target_encoding_1/None_Lookup/LookupTableFindV2"], "attr": {"T": {"type": "DT_DOUBLE"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_0", "shape": [], "dtype": "float32"}]}]}